Autodesk.Revit.DB.ExtensibleStorage.Schema.GetField(System.String)
Gets a Field of a given name from the Schema.
name:
The Field name
Returns:
The Field
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Reading of Entities of this Schema is not allowed to the current add-in.
Since:
2012